"""
https://algo-method.com/tasks/61114gB

### 問題文
私たちが普段使っているグレゴリオ暦には、季節と暦のずれを補正するために平年より $1$ 日多い**うるう年**が存在します。
うるう年は次の規則に従って定められています：
1. 西暦年が $4$ の倍数の年は (原則) うるう年である
2. ただし、西暦年が $100$ の倍数の年は (原則) うるう年でない
3. ただし、西暦年が $400$ の倍数の年は必ずうるう年である
例えば、 $2020$ 年は 1. のみを満たすのでうるう年です。
西暦 $N$ 年はうるう年でしょうか。
### 入力
入力は次の形式で与えられます。
```IOExample
$N$
```
また、入力される値は次の制約を満たします。
- $N$ は $1583$ 以上 $2100$ 以下の整数
### 出力
答えを出力してください。
西暦 $N$ 年がうるう年ならば `Yes` を、そうでないならば `No` を出力してください。
"""

N = int(input())
case1 = N%4 == 0
case2 = N%100 == 0
case3 = N%400 == 0
if(case3):
    print("Yes")
elif(case2):
    print("No")
elif(case1):
    print("Yes")
else:
    print("No")